# HelpPath Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContextualHelp..::..HelpPath Property
ContextualHelp Class See Also
---
The context id, help URL, or help file path.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public string HelpPath { get; set; }
```

Visual Basic
---
```text
Public Property HelpPath As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ HelpPath {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when setting the help path to null or empty. |

# See Also
ContextualHelp Class
Autodesk.Revit.UI Namespace